In [18]:
import numpy as np
from IPython.core.interactiveshell import InteractiveShell

InteractiveShell.ast_node_interactivity = "all"

In [19]:
# create a 2D array
a = np.array([[1, 2, 3], [4, 5, 6]])
a
b = np.array([[7, 8, 9]])
b
np.concatenate((a, b), axis=0)

array([[1, 2, 3],
       [4, 5, 6]])

array([[7, 8, 9]])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [20]:
a = np.arange(1, 9).reshape(2, 4)
a
# split a into 3 sub arrays
a1, a2, a3 = np.split(a, [3, 5], axis=1)

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [21]:
a1
a2
a3

array([[1, 2, 3],
       [5, 6, 7]])

array([[4],
       [8]])

array([], shape=(2, 0), dtype=int64)

In [22]:
a1

array([[1, 2, 3],
       [5, 6, 7]])

In [23]:
a2 = np.array([[7, 8, 9]])
a2

# broadcast 1st dimension a2 to match the shape of a1
a1 + a2

array([[7, 8, 9]])

array([[ 8, 10, 12],
       [12, 14, 16]])

In [24]:
a1.shape
a1

(2, 3)

array([[1, 2, 3],
       [5, 6, 7]])

In [25]:
a2
a2.shape

array([[7, 8, 9]])

(1, 3)

In [26]:
# broadcast 2nd dimension
a1 + a2

array([[ 8, 10, 12],
       [12, 14, 16]])

In [27]:
# calculate the average of each row
np.average(a1 + a2, axis=-1)

array([10., 14.])

In [28]:
a2 = a[0, :]

In [29]:
a = np.array([[1, 2]])
b = np.array([[3], [4]])
a
b
a + b

array([[1, 2]])

array([[3],
       [4]])

array([[4, 5],
       [5, 6]])

In [30]:
x = np.array([1, 2])
y = np.expand_dims(x, axis=[0, 1])
y.shape
x.shape

x[np.newaxis, np.newaxis, :].shape

(1, 1, 2)

(2,)

(1, 1, 2)

In [31]:
y.shape
# throw error since the size of dimension axis 2 is not 1
y.squeeze(axis=2).shape

(1, 1, 2)

ValueError: cannot select an axis to squeeze out which has size not equal to one

In [32]:
a = np.ones([9, 5, 3])
c = np.ones([3, 5])

# matmul and dot are the same for 2D arrays multiplication
np.sum(np.matmul(a, c) != np.dot(a, c), axis=None)

0

In [34]:
a = np.array([[2, 1, np.nan], [3, np.nan, 5]])
a

array([[ 2.,  1., nan],
       [ 3., nan,  5.]])

In [35]:
# calculate average without nan for each row
np.nanmean(a, axis=1)
a.shape

array([1.5, 4. ])

(2, 3)

In [36]:
# calculate average without nan for each column
np.nanmean(a, axis=0)

array([2.5, 1. , 5. ])

In [37]:
import pandas as pd

a = pd.DataFrame([[2, 1, np.nan], [3, np.nan, 5]])
a

   0    1    2
0  2  1.0  NaN
1  3  NaN  5.0

In [38]:
type(a[0])
type(a.loc[0])

pandas.core.series.Series

pandas.core.series.Series

In [39]:
df = pd.read_csv("data/product_hierarchy.csv", index_col=[0])
df.head(5)

,product_length,product_depth,product_width,cluster_id,hierarchy1_id,hierarchy2_id,hierarchy3_id,hierarchy4_id,hierarchy5_id
product_id,,,,,,,,,
P0000,5.0,20.0,12.0,NaN,H00,H0004,H000401,H00040105,H0004010534
P0001,13.5,22.0,20.0,cluster_5,H01,H0105,H010501,H01050100,H0105010006
P0002,22.0,40.0,22.0,cluster_0,H03,H0315,H031508,H03150800,H0315080028
P0004,2.0,13.0,4.0,cluster_3,H03,H0314,H031405,H03140500,H0314050003
P0005,16.0,30.0,16.0,cluster_9,H03,H0312,H031211,H03121109,H0312110917

In [40]:
df.columns
df.index.names

Index(['product_length', 'product_depth', 'product_width', 'cluster_id',
       'hierarchy1_id', 'hierarchy2_id', 'hierarchy3_id', 'hierarchy4_id',
       'hierarchy5_id'],
      dtype='object')

FrozenList(['product_id'])

In [41]:
# get the information of the data frame
# including the number of rows, columns, data types, and memory usage
df.info()

df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 699 entries, P0000 to P0748
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_length  681 non-null    float64
 1   product_depth   683 non-null    float64
 2   product_width   683 non-null    float64
 3   cluster_id      649 non-null    object
 4   hierarchy1_id   699 non-null    object
 5   hierarchy2_id   699 non-null    object
 6   hierarchy3_id   699 non-null    object
 7   hierarchy4_id   699 non-null    object
 8   hierarchy5_id   699 non-null    object
dtypes: float64(3), object(6)
memory usage: 54.6+ KB

product_length    18
product_depth     16
product_width     16
cluster_id        50
hierarchy1_id      0
hierarchy2_id      0
hierarchy3_id      0
hierarchy4_id      0
hierarchy5_id      0
dtype: int64

In [42]:
# result of dataframe groupby can be iterated
for key, sub_df in df.groupby("hierarchy1_id"):
    print(key)
    print(sub_df)

H00
            product_length  product_depth  product_width cluster_id
product_id
P0000                  5.0           20.0           12.0        NaN  \
P0008                  5.0           16.0            5.0  cluster_0
P0009                  5.0           18.0           14.0  cluster_6
P0015                 10.0           33.0           10.0  cluster_1
P0016                  2.0           18.0            8.0  cluster_0
...                    ...            ...            ...        ...
P0719                  6.0           17.0            6.0        NaN
P0724                  6.0           24.0           10.0  cluster_0
P0725                  NaN            NaN            NaN  cluster_0
P0726                  1.0           15.0           10.0  cluster_0
P0733                  2.0            4.0            9.0  cluster_7

           hierarchy1_id hierarchy2_id hierarchy3_id hierarchy4_id
product_id
P0000                H00         H0004       H000401     H00040105  \
P0008                H00         H0000       H000004     H00000400
P0009                H00         H0002       H000201     H00020100
P0015                H00         H0000       H000003     H00000309
P0016                H00         H0004       H000401     H00040105
...                  ...           ...           ...           ...
P0719                H00         H0000       H000004     H00000400
P0724                H00         H0003       H000310     H00031000
P0725                H00         H0004       H000402     H00040212
P0726                H00         H0003       H000312     H00031200
P0733                H00         H0003       H000314     H00031405

           hierarchy5_id
product_id
P0000        H0004010534
P0008        H0000040017
P0009        H0002010012
P0015        H0000030901
P0016        H0004010512
...                  ...
P0719        H0000040001
P0724        H0003100001
P0725        H0004021202
P0726        H0003120001
P0733        H0003140506

[215 rows x 9 columns]
H01
            product_length  product_depth  product_width cluster_id
product_id
P0001                 13.5           22.0           20.0  cluster_5  \
P0010                  2.0           22.0            3.0  cluster_0
P0012                 10.0           20.0           12.3  cluster_0
P0013                  7.1           27.5           13.7        NaN
P0022                  5.7           18.6           10.1  cluster_0
...                    ...            ...            ...        ...
P0738                  3.5            8.5            3.5  cluster_0
P0741                  3.8           16.4            9.5  cluster_0
P0742                  6.4            7.0            6.4  cluster_0
P0747                 23.0           23.0           33.3  cluster_0
P0748                  3.8            4.8           15.3  cluster_0

           hierarchy1_id hierarchy2_id hierarchy3_id hierarchy4_id
product_id
P0001                H01         H0105       H010501     H01050100  \
P0010                H01         H0108       H010801     H01080109
P0012                H01         H0107       H010702     H01070210
P0013                H01         H0105       H010503     H01050309
P0022                H01         H0108       H010809     H01080900
...                  ...           ...           ...           ...
P0738                H01         H0108       H010808     H01080814
P0741                H01         H0106       H010600     H01060013
P0742                H01         H0108       H010811     H01081100
P0747                H01         H0107       H010701     H01070100
P0748                H01         H0108       H010801     H01080110

           hierarchy5_id
product_id
P0001        H0105010006
P0010        H0108010917
P0012        H0107021001
P0013        H0105030906
P0022        H0108090012
...                  ...
P0738        H0108081412
P0741        H0106001345
P0742        H0108110038
P0747        H0107010026
P0748        H0108011006

[181 rows x 9 columns]
H02
            product_length  product_depth  product_width cluster_id
product_id
P0176                  NaN            NaN            NaN  cluster_9  \
P0298                  NaN            NaN            NaN  cluster_9
P0344                  NaN            NaN            NaN  cluster_0
P0413                  0.0            0.0            0.0  cluster_7
P0566                  5.0           20.0           15.0  cluster_0
P0568                  5.0           20.0           30.0        NaN
P0610                  5.0           20.0           30.0  cluster_9
P0630                  NaN            NaN            NaN  cluster_9
P0727                  NaN            NaN            NaN        NaN
P0728                  3.0            4.0            4.0  cluster_0
P0745                  NaN            NaN            NaN  cluster_0

           hierarchy1_id hierarchy2_id hierarchy3_id hierarchy4_id
product_id
P0176                H02         H0210       H021002     H02100200  \
P0298                H02         H0210       H021002     H02100200
P0344                H02         H0209       H020908     H02090804
P0413                H02         H0210       H021002     H02100203
P0566                H02         H0210       H021002     H02100200
P0568                H02         H0210       H021000     H02100001
P0610                H02         H0209       H020900     H02090000
P0630                H02         H0210       H021002     H02100203
P0727                H02         H0209       H020900     H02090000
P0728                H02         H0210       H021000     H02100001
P0745                H02         H0209       H020908     H02090804

           hierarchy5_id
product_id
P0176        H0210020008
P0298        H0210020008
P0344        H0209080429
P0413        H0210020302
P0566        H0210020002
P0568        H0210000107
P0610        H0209000001
P0630        H0210020304
P0727        H0209000001
P0728        H0210000104
P0745        H0209080422
H03
            product_length  product_depth  product_width cluster_id
product_id
P0002                 22.0           40.0           22.0  cluster_0  \
P0004                  2.0           13.0            4.0  cluster_3
P0005                 16.0           30.0           16.0  cluster_9
P0006                  8.5           15.0           15.0  cluster_0
P0007                  2.0           22.0            9.5  cluster_4
...                    ...            ...            ...        ...
P0737                  2.0           25.0            9.0  cluster_3
P0739                  8.5            9.0            8.5  cluster_3
P0740                  1.0           20.0           10.0  cluster_0
P0744                  2.0            7.0            7.0        NaN
P0746                  1.0            1.0            1.0  cluster_0

           hierarchy1_id hierarchy2_id hierarchy3_id hierarchy4_id
product_id
P0002                H03         H0315       H031508     H03150800  \
P0004                H03         H0314       H031405     H03140500
P0005                H03         H0312       H031211     H03121109
P0006                H03         H0316       H031608     H03160817
P0007                H03         H0313       H031305     H03130519
...                  ...           ...           ...           ...
P0737                H03         H0311       H031111     H03111103
P0739                H03         H0312       H031208     H03120817
P0740                H03         H0313       H031305     H03130518
P0744                H03         H0311       H031108     H03110802
P0746                H03         H0314       H031407     H03140702

           hierarchy5_id
product_id
P0002        H0315080028
P0004        H0314050003
P0005        H0312110917
P0006        H0316081708
P0007        H0313051904
...                  ...
P0737        H0311110301
P0739        H0312081713
P0740        H0313051828
P0744        H0311080202
P0746        H0314070202

[292 rows x 9 columns]

In [43]:
df = pd.DataFrame(
    {"A": [3, 5, 7, 6], "B": ["a", "b", "c", "d"]},
    index=pd.MultiIndex.from_product([["bar", "foo"], ["one", "two"]]),
)
df
# stack the DataFrame columns
sdf = df.stack()
sdf

         A  B
bar one  3  a
    two  5  b
foo one  7  c
    two  6  d

bar  one  A    3
          B    a
     two  A    5
          B    b
foo  one  A    7
          B    c
     two  A    6
          B    d
dtype: object

In [44]:
sdf = pd.DataFrame(sdf)
# set the names of index
sdf.index.names = ["first", "second", "third"]

# set the names of columns
sdf.rename(columns={0: "value"}, inplace=True)
sdf.columns = ["col"]
# reset the index to be dataframe columns
sdf = sdf.reset_index()

In [45]:
sdf

  first second third col
0   bar    one     A   3
1   bar    one     B   a
2   bar    two     A   5
3   bar    two     B   b
4   foo    one     A   7
5   foo    one     B   c
6   foo    two     A   6
7   foo    two     B   d

In [46]:
df = pd.DataFrame(
    {
        "foo": ["one", "one", "one", "two", "two", "two"],
        "bar": ["A", "B", "C", "A", "B", "C"],
        "baz": [1, 2, 3, 4, 5, 6],
        "zoo": ["x", "y", "z", "q", "w", "t"],
    }
)
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [47]:
# directly create a pivot table
# row is foo, column is baz, value is zoo

df.pivot(index="foo", columns="baz", values="zoo")

baz    1    2    3    4    5    6
foo
one    x    y    z  NaN  NaN  NaN
two  NaN  NaN  NaN    q    w    t

In [48]:
# can apply a function to a dataframe groupby object
df.groupby('foo').apply(lambda x: x.sort_values('baz', ascending=False)).reset_index(drop=True)

   foo bar  baz zoo
0  one   C    3   z
1  one   B    2   y
2  one   A    1   x
3  two   C    6   t
4  two   B    5   w
5  two   A    4   q